MEASUREMENT_UNIT_ADMIN_TXT = 'Мера измерения'
FAVORITES_ADMIN_TXT = 'В избранном'

VALID_EMPTY = 'Поле {field} не должно быть пустым!'
VALID_AMOUNT = (
    'Количество ингридиентов должно быть не менее 1, указано {amount}.'
)
VALID_TIME = (
    'Минимальное время приготовления 1 минута, указано {cooking_time}.'
)

DEFAULT_ONE = 1

VALID_USERNAME = (
    "Никнейм '{value}' содержит недопустимые символы. "
    'Разрешены только буквы, цифры, подчеркивания, точки, @ и +.'
)

DATA_JOINED = "Все ингредиенты созданы, последний: {name}"
DATA_FAIL = 'Ошибка при создании ингредиентов: возможно, есть дубликаты.'
FAIL_FAIL = 'Файл {file} не найден.'
FORMAT_FAIL = 'Ошибка при обработке файла {file}: {e}'

NO_IMAGE = 'Нет изображения'
